tutorials/fluids/decompressionTank/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Source solids4Foam scripts
source solids4FoamScripts.sh

solids4Foam::caseOnlyRunsWithFoamExtend

# Create the mesh
runApplication blockMesh

# Run the solver
runApplication solids4Foam

# ----------------------------------------------------------------- end-of-file

